Revit 2027 API
View.IsolateCategoriesTemporary Method
 Set categories to be temporarily isolated in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void IsolateCategoriesTemporary(
	ICollection<ElementId> elementIds
)
Public Sub IsolateCategoriesTemporary (
	elementIds As ICollection(Of ElementId)
)
public:
void IsolateCategoriesTemporary(
	ICollection<ElementId^>^ elementIds
)
member IsolateCategoriesTemporary :
        elementIds : ICollection<ElementId> -> unit
Parameters
elementIds ICollection<ElementId>
 Ids of categories to be isolated.
Exceptions
Exception | Condition
ArgumentException |  Some elements in elementIds do not correspond to a Category.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
View Class
Autodesk.Revit.DB Namespace